## EDA ##

- 1) Pandas : Data frame applications 
     
- 2) Numpy : Numerical python

- 3) Matplotlib : used for plotting

- 4) Seaborn : plotting
 
- 5) Bonkhe : plot

## Machine Learning ##

- 7) Sickit-Learn : sklearn

## Deep Learning ##

- 8) Tensorflow : Developed Google

- 9) Keras : Google

- 10) Pytorch : Facebook

## NLP ##

- 11) NLTK : Natural language toolkit

- 12) Scipy

## BERT  ##

- 13) Transformers : Hugging face (google)

## Google Models ## 

- 14) Specific google packages

## Azure ML ##

- 15) Azure packages

## GenAI ##

- 16) Gemini - Google

- 17) ChatGpt : openAi

## LangChain ##

- LangChain packages

## Create a dataframe using list ##

#- list  == conversion into dict and vise versa

In [2]:
import pandas as pd

names = ['Anuja','Suraj', 'Gauri']

age = ['33','34', '1']

pd.DataFrame()   # empty data frame will be created , no rows , no columns

Empty DataFrame
Columns: []
Index: []

In [11]:
pd.DataFrame(names)

       0
0  Anuja
1  Suraj
2  Gauri

In [12]:
pd.DataFrame(names,age)

        0
33  Anuja
34  Suraj
1   Gauri

In [13]:
# first positional argument : data
# second positional argument : index

pd.DataFrame(zip(names,age))

       0   1
0  Anuja  33
1  Suraj  34
2  Gauri   1

In [14]:
import pandas as pd

names = ['Anuja','Suraj', 'Gauri']

age = ['33','34', '1']

relation = ['Mother', 'Father', 'Child']

pd.DataFrame(zip(names,age),relation)

            0   1
Mother  Anuja  33
Father  Suraj  34
Child   Gauri   1

** provide the column names **

In [18]:
names = ['Anuja','Suraj', 'Gauri']

age = ['33','34', '1']

relation = ['Mother', 'Father', 'Child']

place = ['Belgaum','Kolhapur','Pune']

pd.DataFrame(zip(names,age,relation,place),
             columns=['Names','Age','Relation','place'])

   Names Age Relation     place
0  Anuja  33   Mother   Belgaum
1  Suraj  34   Father  Kolhapur
2  Gauri   1    Child      Pune

In [32]:
names = ['Anuja','Suraj', 'Gauri']

age = ['33','34', '1']

relation = ['Mother', 'Father', 'Child']

data= zip(names,age,relation)
cols = ['Names','Age','Relation']

pd.DataFrame(data,columns=cols)  # store datafrma in df

   Names Age Relation
0  Anuja  33   Mother
1  Suraj  34   Father
2  Gauri   1    Child

In [25]:
df = pd.DataFrame(data,columns=cols)  # store datafrma in df

In [23]:
type(df)

pandas.core.frame.DataFrame

## Add new column ##

- Check the number of rows in already existed data

- for ex in above the dataframe has 3 rows

- you need to create a new list with number of rows ,  3 rows

- and that list equate to the data frame

In [48]:
names = ['Atharv','Shreyash', 'Bharghavi']

age = ['28','30', '31']

city = ['Blore', 'Hyd', 'Pune']

data= zip(names,age,city)
cols = ['Names','Age','city']

df=pd.DataFrame(data,columns=cols) 

df

       Names Age   city
0     Atharv  28  Blore
1   Shreyash  30    Hyd
2  Bharghavi  31   Pune

## create new column and update with new data

In [51]:
job = ["Data scientist", 'Data Engineer', 'Cyber Security']  
df['job'] = job

In [52]:
df

       Names Age   city             job
0     Atharv  28  Blore  Data scientist
1   Shreyash  30    Hyd   Data Engineer
2  Bharghavi  31   Pune  Cyber Security

## How to change the index ##

In [54]:
names = ['Atharv','Shreyash', 'Bharghavi','Gauri']

age = ['28','30', '31','29']

city = ['Blore', 'Hyd', 'Pune','Mumbai']

data= zip(names,age,city)
cols = ['Names','Age','city']
idx = ['A','B','C','D']      # number of values in list = number of index

df=pd.DataFrame(data,index=idx,columns=cols) 
df

       Names Age    city
A     Atharv  28   Blore
B   Shreyash  30     Hyd
C  Bharghavi  31    Pune
D      Gauri  29  Mumbai

## Note ##
- number of list = **number of columns**

- number of values inside list = **number of rows**

## Shape ##

- Number of Rows
- Number of Columns

In [56]:
#matrix format

df.shape     # number of rows and columns 
# 4 rows and 3 columns

(4, 3)

In [57]:
print("The number of rows are:",df.shape[0])
print("The number of columns are:",df.shape[1])

The number of rows are: 4
The number of columns are: 3

## How to drop the columns ##

- In order to drop column we need 3 arguments
  - column name
  - axis  = 0 , **represents rows** , axis =1 , **represents column**
  - inplace - we are dropping column means we are modifying the df, so this modifications we want to save in same or different variable
  - if you want to keep in the same variable then inplace=True  **inplace=same place**

In [60]:
df

       Names Age    city
A     Atharv  28   Blore
B   Shreyash  30     Hyd
C  Bharghavi  31    Pune
D      Gauri  29  Mumbai

In [62]:
df.drop('city',axis=1,inplace=True)

In [63]:
df

       Names Age
A     Atharv  28
B   Shreyash  30
C  Bharghavi  31
D      Gauri  29

In [68]:
df1 = df.drop('Age',axis=1)

In [69]:
df1

       Names
A     Atharv
B   Shreyash
C  Bharghavi
D      Gauri

In [71]:
df2 = df.drop('D',axis=0)

In [72]:
df2

       Names Age
A     Atharv  28
B   Shreyash  30
C  Bharghavi  31

In [73]:
df,df1,df2

(       Names Age
 A     Atharv  28
 B   Shreyash  30
 C  Bharghavi  31
 D      Gauri  29,
        Names
 A     Atharv
 B   Shreyash
 C  Bharghavi
 D      Gauri,
        Names Age
 A     Atharv  28
 B   Shreyash  30
 C  Bharghavi  31)

In [74]:
names = ['Atharv','Shreyash', 'Bharghavi','Gauri']

age = ['28','30', '31','29']

city = ['Blore', 'Hyd', 'Pune','Mumbai']

data= zip(names,age,city)
cols = ['Names','Age','city']
idx = ['A','B','C','D']      # number of values in list = number of index

df=pd.DataFrame(data,index=idx,columns=cols) 
df

       Names Age    city
A     Atharv  28   Blore
B   Shreyash  30     Hyd
C  Bharghavi  31    Pune
D      Gauri  29  Mumbai

In [80]:
df.drop(['Age','city'],axis=1,inplace=True)

In [81]:
df

       Names
A     Atharv
B   Shreyash
C  Bharghavi
D      Gauri

## How to save Dataframe ##

In [3]:
names = ['Atharv','Shreyash', 'Bharghavi','Gauri']

age = ['28','30', '31','29']

city = ['Blore', 'Hyd', 'Pune','Mumbai']

data= zip(names,age,city)
cols = ['Names','Age','city']
idx = ['A','B','C','D']      # number of values in list = number of index

df=pd.DataFrame(data,index=idx,columns=cols) 
df

       Names Age    city
A     Atharv  28   Blore
B   Shreyash  30     Hyd
C  Bharghavi  31    Pune
D      Gauri  29  Mumbai

**Generally dataframes are of 2 types:**
- csv[comma seperated value]
-  excel

In [97]:
df.to_csv("dataCSV.csv")   # stored in data.csv file , extra index is coming

In [4]:
df.to_excel("data2.xlsx",index=False)